/*----------------------------------------------------------*
 *                                                          *
 * Korean Part-Of-Speech Tagging System ( kts ) Version 0.9 *
 *                                                          *
 * Sang Ho Lee                                              *
 *                                                          *
 * jhlee@csone.kaist.ac.kr shlee2@adam.kaist.ac.kr          *
 *                                                          *
 * Computer Systems Lab.                                    *
 * Computer Science , KAIST                                 *
 *                                                          *
 * irrtbl.h ( Korean POS Tagging System : irr table )       *
 *                                                          *
 *----------------------------------------------------------*/

#define YONGEON1  356 /* 1 음절짜리 용언의 마지막 음절 갯수         */
#define YONGEON2  308 /* 2 음절짜리 용언의 마지막 음절 갯수         */
#define YONGEON3  191 /* 3 음절짜리 용언의 마지막 음절 갯수         */
#define BUSA1     189 /* 1 음절짜리 부사의 마지막 음절 갯수         */
#define BUSA2     517 /* 2 음절짜리 부사의 마지막 음절 갯수         */
#define BUSA3     139 /* 3 음절짜리 부사의 마지막 음절 갯수         */
#define BUSA4     362 /* 4 음절짜리 부사의 마지막 음절 갯수         */
#define BUSA5      79 /* 5 음절짜리 부사의 마지막 음절 갯수         */
#define EXCL      240 /* 관형사와 감탄사의 마지막 음절 갯수         */

#ifdef BASELING2
#define NOTMORPH   10
#else
#define NOTMORPH   1
#endif



typedef struct _eumjeoltbl_ {
  unsigned char *eumjeolset ; 
  int size ; 
} EUMJEOLTBL ; 

/*
 * `느',`으',`그',`을',`시'로 끝나는 용언은
 * 사전에 모두 등록  
 * 위의 경우는 총 40여개 밖에 않된다.
 */

/*
 * 조사의 첫 음절로 사용되는 음절 : 48개 + 1개 "한" (강승식, 151페이지) 
 * 추가: 잖쟎없군(잖아,없이,개군)
 */
unsigned char josa_set_1[] ="가같게고과군까께나는니다대더도든\
라랑로를마만말며밖보부서아야없에엔엘여와요으은을의이\
인일잖쟎조지처치커토하";


/*
 * 조사의 두 번째 이상의 음절로 사용되는 음절 : 48개 (강승식, 151페이지) 
 * 추가 : 아소면요 (~잖아,잖소,라면,어요)
 */
unsigned char josa_set_2[] ="가게고곤과까나녕는니다도든따라랑러\
럼로록론를마만말며면보부서선소손써씩아야에엔여옵요와은\
을의이인저조즉지진차처치커큼터테하";


/*
 * "서"를 넣야 "가서","와서"등의 처리가 됨
 * "서" 추가함
 * '래' 추가  (갈래,올래,가래,사래)
 * 추가: 야잖 (해야,와야..) 십 (십시오..)
 *
 * 어미의 첫 음절로 사용되는 음절 : 72개 + "이" (강승식, 151페이지) 
 * 추가 : "죠잖쟎가긴"(ㄴ가,죽긴...)
 */
unsigned char eomi_set_1[]= "가거건것게고곤관구군기긴나냐네노\
느는니다단담답더던데도되든듯디라래란람랍랴러런려련렴\
렷로리마매며면므사서세소쇠습십아야어언엇오올옵외요으\
은을음읍이자잔잖쟎잘죠지진질";


/*
 * 어미의 두 번째 이상의 음절로 사용되는 음절 : 105개 ;; (강승식, 151페이지)
 * 추가 : 아 (~잖아)
 */
unsigned char eomi_set_2[]= "가간거걸고구군기까깐께꼬꾸끔나냐\
네뇨느는늘니다단담답대댄더던데도되드든들디라락란람랑\
래랴러런레려련렴렷로록료를리마만말망매먼며면무므바밖\
부뿐새서선세셔소쇼수슨습시쏘아야어언에오옵와외요은의\
이자작저정즉지진치큼터피";


/* 
 * 'ㅡ'로 끝나는 용언의 끝음절 (강승식54페이지)
 * char syl_eu[]= "끄뜨르쁘쓰크트프";
 */


/*
 * 'ㅏ'로 끝나는 용언의 끝음절 (강승식 65) 
 * 용언이 '아'로 시작되는 어미와 결합하여 생략된 '아'를 복원 할때 사용
 * char syl_a[]="가까나따라마사싸자짜차타파하";
 */

/* 
 * 'ㅓ'로 끝나는 용언의 끝음절 (강승식66)
 * char syl_eo[]="너서써";
 */


/*
 * 1음절 용언의 마지막 음절로 사용되는 음절 : 356개
 * "ㅁㅡㄺ,ㅃㅜㄺ,ㅉㅗㅈ,ㅎㅓ" 제외
 */
unsigned char syl_yongeon_1[]=
 "가갈갉감갖같갚개걷걸검게겪겯겹고곧골곪곯곱괄괠괴굳굴굵굶굻굽궂긁\
긋기긷길깁깃깊까깎깔깜깨꺾껌꼬꼲꼴꼽꽂꾀꾸꿇꿰뀌끄끊끌끓끗끼나낚날\
낡남낫낮낳내냅널넓넘넣녹놀높놓뇌누눅눋눕뉘늘늙늦닦닫달닮닳담닺닿대\
덖덜덥덮데돋돌돕되두뒤듣들딛따땋때떨떫떼뙤뚫뛰뜨뜯띄띠마막많말맑맞\
맡매맵맺먹멀멎메모몰묵묶문묻물믓미믿밀밉및박받밝밞밟밭배뱉벋벌벗베\
보볶뵈뵙붇불붉붓붙비빅빌빗빚빨빻빼뺏뻗뻠뽑뿜삐사삭살삶삼새서석섞설\
섧세속솎솔솟쇠숙숨쉬쉽슬식신싣싫심싶싸쌓쌔쌨써썩썰쏘쏟쐬쑤쓰쓸쓿씌\
씹씻안앉않알앍앓앗약얇얕얹얻얼얽업없엎에역엮열엷옅오옥옭옮옳외욱울\
웃읊이익일읽잃입잇있잊자작잘잡잣잦재적절젊접젓젖조졸좁좆좇좋죄주죽\
줄줍쥐지질짊집짓짖짙짚짜짧째쪼쫓쬐찌찍찢찧차참찾채추축춥치켜크키타\
태털톺튀트틀틔파팔패펴폐푸풀품피하핥헐헤호홅훑희흔흩희";


/*
 * 2음절 용언의 마지막 음절로 사용되는 음절 : 308 
 * "ㄱㅡㅊ,ㅇㅜㅈ" 제외
 */
unsigned char syl_yongeon_2[] =
 "가각갈감갑갖같갛개걷걸겁겆겋겠겯겹곧곯고구굳굴굽궂귀글금긋기긷깁\
까깎깔깝깨꺽꺾껍꼬꼽꽂꾀꾸꿎뀌끊끌끓끼나날납낮내널널넓넘넣네녹놀높\
놓뇌누니늘늙늦늬니닐닦닫달담답닿대덥덮돋돌되두들둡뒤듣들듬디딛딪따\
딸때떨떱떻떼뚤뚫뛰뜨뜯뜰띄띠라랍랗래럽렇레렵롭뢰루르릊릍리립마막많\
말맑맙맞맡맣매맺먹멀멓메멸몰묻물묽미믿밉박받밟밭배뱉밸벗베볍보볶뵈\
불붉붓붙비빌빚빨빼뻗뽑뿜쁘삭살삶삼새서섞설섭세솔솟쇠수숫쉬숩슬슴습\
식신싣심싶싸쌓쌔써쏘씨쑵쓰쓸씹안앉알앗애약얗얹얻업없엎엽엾옇오옵우\
울웃위의이익일입잇있자잖잡쟎적젊접젓좁좇좋지주죽줍쥐지지길집짓짖짚\
짜짢짭쩍쩝쪼쫍쫓쭈쭙찌찧차찮찾채추취치칠컫켜쿠퀴클키타탑태텁투툴트\
틀티파팔패풀피하헙훑희히";


/*
 * 3음절 이상 용언의 마지막 음절로 사용되는 음절 : 191
 */
unsigned char syl_yongeon_3[] = 
 "가감갑같갛개걷걸겁겋겹곱굽궂귀글긋기깊까깍깔깝껍꼽꽂꾀꾸뀌끌끼나\
납내넘넣녹놀놓눅눕늙니닐닫달담답대돌되두둡듣들듬디딪따땁때떨떼뛰뜨\
뜯라랍랗래럽렇롭루르리막많말맞맡맣매먹멓메몰묵묻물미밀박받밟벗보뵈\
불붓붙비빌빨빼뽑쁘사삭살삶삼새서석세수쉬신싸쌓쌨쎄쏘쏟쐬쓰안앉않암\
얗없엎옇오옵우울위이익읽입잇있자잖압적접죄주죽줍쥐지집짓짖짚짜쩍쫓\
쬐찍찧차찮채추치칠켜크키타투튀트틀티파팔패풀프피하훑히";


/*
 * 1음절 부사의 마지막 음절로 사용되는 음절 : 189
 * 'ㅃㅠㄱ, 
 */
unsigned char syl_busa_1[] = 
 "갓게곧깍깩깽꺅꺽꼭꽉꽝꽤꽥꽹꾹꿍꿩꿱끙끽낑노늘다닥단담댕더덜뎅동\
둥득듯딱딴땅땡떡떵뗑또똑뚜뚜뛰막매맴못및박뱅뱍벅복부북붕빙빵빼빼뺑\
뺙뻥뽕뿡삐삑삥삭색석솨쇄순쉬싹쌕써썩쏙쏴쐐쑥쓱씩씽안앵엉역영예왜왝\
왱욍우원웩웽윙일잉작잘정젤족좀좍죄죽즉직짝짱쨍쩍쫙쭉찍찡착참채척첨\
촉축칵캑캥캭컁콕콩콱쾅쿡쿵퀑킥탁탕턱톡통툭퉁퉤팍팡팩팽퍅퍽펑폭퐁푸\
푹풍픽핑하학해허헉헤헹호혹확홱회획후훅휘휙혹훙히힝" ; 


/*
 * 2음절 부사의 마지막 음절로 사용되는 음절 : 517
 */
unsigned char syl_busa_2[] = 
 "가각간갈갓강개갱걀거걱걸겁겅게결경고곧골곰과구국권국근금급긋기긴\
깃깅까깍깐깔깨깩깰깽꺅꺌꺽껄껏께껙꼬꼭꼴꽁꽉꽐꽝꽥꽹꽤꾜꾸꾹꾹꿀꿍\
꿜꿩꿱끈끌끔끗끙끽낄낏낑나낙날낮낱내냠냥년녕는니닐다닥단달당대댁댕\
더덕덜덩데덱도독돌동돨되두둑둘둥득들들듭듯등디딩따딱딸땅때땍땡떡떨\
떵떽뗑똑똘똥똴뚜뚝뚤뚱뚤뜸뜻띵락랑래략량러럭럼렁레려력례로록론루룩\
른름릇리마만말매맴머멍명모목못묘무믓미박반발방배뱅뱍벅번벌범법벙변\
복봉부북분붓붕비빙빡빨빵빼빽뺑뺙뻑뻘뻥뽁뽕뿍뿐뿟뿡삐삑삥사삭살삼상\
새색샐생서석선설섬성세소속손솔송솨솰수술숨숭슬승시식신실싯싹쌀쌍쌕\
써썩썰썽쏙쏴쑤쑥쓱씩씬씽아악앙애앵야약양어언엄엉에역연영예오옥올옹\
왈왕왜왝왱왱용우욕운웃월웩웽위윙유은음응의이익인일잉자작잘장재잴쟁\
저적전절점접정제조족졸종좍좔죔주죽줄중즉즘증지직질짓징짝짤짭짱째짹\
쨀쨍쩍쩔쩝쩡쪽쫄쫙쫠쭉쭐쭝쯤찌직찐찔찡차착찬찰참창채처척천철첨첩청\
체초촐총최추축출춤충츰츤치친침칫칵캉캑캥캭컁컥컨컷컹켜코콕콜콩콱콸\
쾅쿡쿨쿵퀄퀑큰킁킥킬킹탁탈탐탕태탱턱털텅톡통퇴투툭툴퉁퉤특틀팅팍판\
팔팡팩팽퍅퍽펄펑편평폭폴퐁푸푹푼풀풋풍피픽필핑하한할해향허헐헤혀혁\
호홀홀홉홍확활홧황홰홱회획후훅훌훨휘휙흐흑희히" ; 


/*
 * 3음절 부사의 마지막 음절로 사용되는 음절 : 139
 */
unsigned char syl_busa_3[] = 
 "가각간건게결경고과금기껏꼴꾸꿍끈끔나내년는니다닥달당대더덕덧덩도\
독동두둑둥득든듯디따뗑뚱라락람랑래러럭럼렁레려로록루룩르륵를릉리마\
막만며면명모미바반보분불비삐상새생서소수스시신실써아야어에여오와위\
은음이일작장적전절정중죽지직짝쪽쭉처청체추충침칭케코콩쿵큼탕투튼퍼\
푸피하한해호후히" ; 


/*
 * 4음절 부사의 마지막 음절로 사용되는 음절 : 362
 */ 
unsigned char syl_busa_4[] = 
 "가각간강개객갬갱걱건걸검겁겅게격고곡곤골곰곳공구군굴굼귀근글금긋\
기깃깅깆깍깔꺽껏꼴꽁꽝꾸꾹끈끔끗끽낏나난날너늑늘늠니닐다닥단달담당\
대댁댕덕덜덤덩데덱뎅도독돌동두둑둔둘등득든들듬듭등디따딱딸땅땍떡떵\
떽똑똘똥뚝뚤뚱뜩뜬뜰뜸뜻라락란람랑래랴러럭런럼렁레렷례로록롱루룩룽\
르른름릇릉릊리림릿마막만말맘망먹멀멍메며면몃모목몽묵문물뭇미밀밋박\
발밤방배벅번범벙복북비빚빡빵뻑뼛뿍뿐뿟삐사삭산살삼상샅서석선설섬성\
속솜송순숨숭슥슬슴슷시신실심싯싸싹쌀쌍썩썰썽쏙쏭쑥쑹쓱씬악알암야어\
얼엄엉에여역연엿영오옥옹우욱울웃월위을음의이일임자작잔잘장적전절정\
제족졸종주죽줄줅중즉즐즘지직진질짐짓짜짝짱째쩍쩡쪽쫄쫑쭉쭐쭝쯤찍찐\
찔착찬창척첨첩청촘추축춤충츰치친칠침칫칵캉컥컹케콜콤쾅쿰큰큼키타탁\
탈탓탕터턱털텅톡톨통툭툴툼틀틈팍팔팡퍽펄폭푸푹푼플픗피핏하함해호히" ; 


/*
 * 5음절 부사의 마지막 음절로 사용되는 음절 : 79
 */
unsigned char syl_busa_5[] = 
 "가게고굴귀굴기깽끙끈나는니다닥당덕덜덩도독동둑둥득긋등딱떡똥뚱라\
락람랑럭럼렁레로록롱루룩룽르륵릉리막만먹면반번벙불뻔산성숭실쑥알야\
에이작장적정족죽직쩍쿵탕텅히" ; 


/*
 * 관형사와 감탄사의 마지막 음절로 사용되는 음절 : 240
 * 'ㅤㅈㅕㄱ'
 */
unsigned char syl_excl[] = 
 "가각간강갖개걔거걸게경계고곱괘괴구군그근기긴깟꼭꾸꿍끄끼나난내냐\
너넉네년녕녜놈느는늬니닌다단닷대댓덟덧돈동두둥둬든디따딴라랄랑래랜\
러런럼레려렴로롱루룩른리마만맛매맨머먼면몇모무뭇뭐미바반백별보복본\
봐비사삼새서석섯성세소쇄쇼수순숴쉬쉰슨시십싸쌘쎄쒜쓸씨아악암앗앙애\
액앵야약얏양얘어억엄엇에엑엥여열엿예옛오온옹와왕왜외왼요용우움워원\
웬위유육은을음응의이익일잇자작장재저적전점제조죄죔주지질짓쩌쩟쯧차\
참천체총치칠카커컴쿠크키타토트튼틴팅팔펑풀하한할해햄허헌험헤헴현호\
홉화후흐흔흠흥희히힝" ; 

/*
 * 형태소가 될 수 없는 음절 : 20
 */

/*
unsigned char not_syl_morph[] = 
  "껀께네녕느는늘들랑럼를뿐었였세셨써큼했" ; 
*/

unsigned char not_syl_morph[] = 
  "껀께녕느는를었였셨했" ; 


EUMJEOLTBL yongeonTbl[3] = {
   { syl_yongeon_1 , YONGEON1 } , 
   { syl_yongeon_2 , YONGEON2 } , 
   { syl_yongeon_3 , YONGEON3 }
 } ; 

EUMJEOLTBL busaTbl[5] = {
   { syl_busa_1 , BUSA1 } , 
   { syl_busa_2 , BUSA2 } , 
   { syl_busa_3 , BUSA3 } , 
   { syl_busa_4 , BUSA4 } , 
   { syl_busa_5 , BUSA5 }
 } ; 

EUMJEOLTBL exclTbl[1] = {
   { syl_excl   , EXCL }
 } ; 

EUMJEOLTBL notmorphTbl[1] = {
   { not_syl_morph , NOTMORPH }
 } ; 


/*********************************************
 *****         End of ktssyll.h          *****
 *********************************************/

