/*------------------------------------------------------*
 *                                                      *
 * Korean Part-Of-Speech Tagger ( KTS ) Version 0.9     *
 *                                                      *
 * Sang Ho Lee                                          *
 *                                                      *
 * jhlee@csone.kaist.ac.kr shlee2@adam.kaist.ac.kr      *
 *                                                      *
 * Computer Systems Lab.                                *
 * Computer Science , KAIST                             *
 *                                                      *
 * ktstbls.h ( Korean POS Tagger Tables Header File )   *
 *                                                      *
 *------------------------------------------------------*/

#ifdef __TAGSET__

char posTags[__NUMOFTAG__][4] = { /* Part Of Speech Tag Set */
	 "INI" , /* 0  */
	 "s,"  , /* 1  */
	 "s."  , /* 2  */
	 "s`"  , /* 3  */
	 "s'"  , /* 4  */
	 "s-"  , /* 5  */
	 "su"  , /* 6  */
	 "sw"  , /* 7  */
	 "sy"  , /* 8  */
	 "f"   , /* 9  */
	 "nnn" , /* 10 */
         "nct" , /* 11 */
	 "nca" , /* 12 */
	 "ncs" , /* 13 */
	 "nc"  , /* 14 */
	 "nq"  , /* 15 */
	 "nbu" , /* 16 */
	 "nb"  , /* 17 */
	 "npp" , /* 18 */
	 "npd" , /* 19 */
	 "nn"  , /* 20 */
	 "pv"  , /* 21 */
	 "pad" , /* 22 */
	 "pa"  , /* 23 */
	 "px"  , /* 24 */
	 "md"  , /* 25 */
	 "mn"  , /* 26 */
	 "m"   , /* 27 */
	 "at"  , /* 28 */
	 "ad"  , /* 29 */
	 "ajw" , /* 30 */
	 "ajs" , /* 31 */
	 "a"   , /* 32 */
	 "i"   , /* 33 */
	 "jc"  , /* 34 */
	 "jcm" , /* 35 */
	 "jcv" , /* 36 */
	 "jca" , /* 37 */
	 "jcp" , /* 38 */
	 "jx"  , /* 39 */
	 "jj"  , /* 40 */
	 "ecq" , /* 41 */
	 "ecs" , /* 42 */
	 "ecx" , /* 43 */
	 "exm" , /* 44 */
	 "exn" , /* 45 */
	 "exa" , /* 46 */
	 "efp" , /* 47 */
	 "ef"  , /* 48 */
	 "xn"  , /* 49 */
	 "xpv" , /* 50 */
	 "xpa" , /* 51 */
	 "xa"  , /* 52 */
	 "FIN" , /* 53 */
	 "int" , /* 54 : 매개 모음 '으' */
	 } ; 

char posTagsName[__NUMOFTAG__][20] = { /* Part Of Speech Tag Set */
	 "시작"             , /* 0  */
	 "쉼표"             , /* 1  */
	 "종결"             , /* 2  */
	 "여는따옴표"       , /* 3  */
	 "닫는따옴표"       , /* 4  */
	 "이음표"           , /* 5  */
	 "단위"             , /* 6  */
	 "화폐단위"         , /* 7  */
	 "기타기호"         , /* 8  */
	 "외국어"           , /* 9  */
	 "숫자"             , /* 10 */
	 "시간성보통명사"   , /* 11 */
	 "동작성보통명사"   , /* 12 */
	 "상태성보통명사"   , /* 13 */
	 "보통명사"         , /* 14 */
	 "고유명사"         , /* 15 */
	 "단위성의존명사"   , /* 16 */
	 "의존명사"         , /* 17 */
	 "인칭대명사"       , /* 18 */
	 "지시대명사"       , /* 19 */
	 "수사"             , /* 20 */
	 "동사"             , /* 21 */
	 "지시형용사"       , /* 22 */
	 "형용사"           , /* 23 */
	 "보조용언"         , /* 24 */
	 "지시관형사"       , /* 25 */
	 "수관형사"         , /* 26 */
	 "관형사"           , /* 27 */
	 "시간부사"         , /* 28 */
	 "지시부사"         , /* 29 */
	 "단어접속부사"     , /* 30 */
	 "문장접속부사"     , /* 31 */
	 "부사"             , /* 32 */
	 "감탄사"           , /* 33 */
	 "격조사"           , /* 34 */
	 "관형격조사"       , /* 35 */
	 "호격조사"         , /* 36 */
	 "부사격조사"       , /* 37 */
	 "서술격조사"       , /* 38 */
	 "보조사"           , /* 39 */
	 "접속조사"         , /* 40 */
	 "대등적연결어미"   , /* 41 */
	 "종속적연결어미"   , /* 42 */
	 "보조적연결어미"   , /* 43 */
	 "관형사형전성어미" , /* 44 */
	 "명사형전성어미"   , /* 45 */
	 "부사형전성어미"   , /* 46 */
	 "선어말어미"       , /* 47 */
	 "종결어미"         , /* 48 */
	 "명사접미사"       , /* 49 */
	 "동사파생접미사"   , /* 50 */
	 "형용사파생접미사" , /* 51 */
	 "부사파생접미사"   , /* 52 */
	 "끝"               , /* 53 */
	 "매개모음"         , /* 54 : 매개 모음 '으' */
	 } ; 

#else

extern char posTags[__NUMOFTAG__][4] ; 
extern char posTagsName[__NUMOFTAG__][20] ;  

#endif


